data/saml.php.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol">
	<s:Body>
		<ExecuteAuthnRequest xmlns="http://www.wizards.com/Service/2013-03">
			<requestMessage xmlns:i="http://www.w3.org/2001/XMLSchema-instance">&lt;samlp:AuthnRequest
				xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol"
				xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion"
				ID="_13df736a-c64b-b169-ea92-3c067367f070" Version="2.0"
				IssueInstant="2015-01-28T21:38:42Z"
				xmlns="urn:oasis:names:tc:SAML:2.0:protocol"&gt;&lt;saml:Issuer
				AllowCreate="false" SPNameQualifier="accounts.wizards.com"
				Format="urn:oasis:names:tc:SAML:2.0:nameidformat:entity"
				xmlns="urn:oasis:names:tc:SAML:2.0:assertion"/&gt;&lt;samlp:Extensions&gt;&lt;Credentials
				UserName="Faulo"
				Password="753c679171c9c773a04dd557dc36c27180bcd2d77f4a3aaf729bc10e5e29c9eb"
				RememberMe="false" xmlns="##other"
				/&gt;&lt;/samlp:Extensions&gt;&lt;/samlp:AuthnRequest&gt;</requestMessage>
		</ExecuteAuthnRequest>
	</s:Body>
</s:Envelope>